#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # juju_application.hydra will be created
  + resource "juju_application" "hydra" {
      + constraints = (known after apply)
      + id          = (known after apply)
      + model       = "identity-platform"
      + name        = "hydra"
      + placement   = (known after apply)
      + principal   = (known after apply)
      + trust       = true
      + units       = 1

      + charm {
          + channel  = "edge"
          + name     = "hydra"
          + revision = (known after apply)
          + series   = "jammy"
        }
    }

  # juju_application.kratos will be created
  + resource "juju_application" "kratos" {
      + constraints = (known after apply)
      + id          = (known after apply)
      + model       = "identity-platform"
      + name        = "kratos"
      + placement   = (known after apply)
      + principal   = (known after apply)
      + trust       = true
      + units       = 1

      + charm {
          + channel  = "edge"
          + name     = "kratos"
          + revision = (known after apply)
          + series   = "jammy"
        }
    }

  # juju_application.login_ui will be created
  + resource "juju_application" "login_ui" {
      + constraints = (known after apply)
      + id          = (known after apply)
      + model       = "identity-platform"
      + name        = "login-ui"
      + placement   = (known after apply)
      + principal   = (known after apply)
      + trust       = true
      + units       = 1

      + charm {
          + channel  = "edge"
          + name     = "identity-platform-login-ui-operator"
          + revision = (known after apply)
          + series   = "jammy"
        }
    }

  # juju_integration.integration["0"] will be created
  + resource "juju_integration" "integration" {
      + id    = (known after apply)
      + model = "identity-platform"

      + application {
          + endpoint  = "database"
          + name      = "postgresql"
          + offer_url = (known after apply)
        }
      + application {
          + endpoint  = "pg-database"
          + name      = "hydra"
          + offer_url = (known after apply)
        }
    }

  # juju_integration.integration["1"] will be created
  + resource "juju_integration" "integration" {
      + id    = (known after apply)
      + model = "identity-platform"

      + application {
          + endpoint  = "database"
          + name      = "postgresql"
          + offer_url = (known after apply)
        }
      + application {
          + endpoint  = "pg-database"
          + name      = "kratos"
          + offer_url = (known after apply)
        }
    }

  # juju_integration.integration["10"] will be created
  + resource "juju_integration" "integration" {
      + id    = (known after apply)
      + model = "identity-platform"

      + application {
          + endpoint  = "kratos-endpoint-info"
          + name      = "kratos"
          + offer_url = (known after apply)
        }
      + application {
          + endpoint  = "kratos-endpoint-info"
          + name      = "login-ui"
          + offer_url = (known after apply)
        }
    }

  # juju_integration.integration["11"] will be created
  + resource "juju_integration" "integration" {
      + id    = (known after apply)
      + model = "identity-platform"

      + application {
          + endpoint  = "ui-endpoint-info"
          + name      = "hydra"
          + offer_url = (known after apply)
        }
      + application {
          + endpoint  = "ui-endpoint-info"
          + name      = "login-ui"
          + offer_url = (known after apply)
        }
    }

  # juju_integration.integration["12"] will be created
  + resource "juju_integration" "integration" {
      + id    = (known after apply)
      + model = "identity-platform"

      + application {
          + endpoint  = "ui-endpoint-info"
          + name      = "kratos"
          + offer_url = (known after apply)
        }
      + application {
          + endpoint  = "ui-endpoint-info"
          + name      = "login-ui"
          + offer_url = (known after apply)
        }
    }

  # juju_integration.integration["2"] will be created
  + resource "juju_integration" "integration" {
      + id    = (known after apply)
      + model = "identity-platform"

      + application {
          + endpoint  = "ingress"
          + name      = "public-ingress"
          + offer_url = (known after apply)
        }
      + application {
          + endpoint  = "public-ingress"
          + name      = "hydra"
          + offer_url = (known after apply)
        }
    }

  # juju_integration.integration["3"] will be created
  + resource "juju_integration" "integration" {
      + id    = (known after apply)
      + model = "identity-platform"

      + application {
          + endpoint  = "ingress"
          + name      = "public-ingress"
          + offer_url = (known after apply)
        }
      + application {
          + endpoint  = "public-ingress"
          + name      = "kratos"
          + offer_url = (known after apply)
        }
    }

  # juju_integration.integration["4"] will be created
  + resource "juju_integration" "integration" {
      + id    = (known after apply)
      + model = "identity-platform"

      + application {
          + endpoint  = "ingress"
          + name      = "login-ui"
          + offer_url = (known after apply)
        }
      + application {
          + endpoint  = "ingress"
          + name      = "public-ingress"
          + offer_url = (known after apply)
        }
    }

  # juju_integration.integration["5"] will be created
  + resource "juju_integration" "integration" {
      + id    = (known after apply)
      + model = "identity-platform"

      + application {
          + endpoint  = "admin-ingress"
          + name      = "hydra"
          + offer_url = (known after apply)
        }
      + application {
          + endpoint  = "ingress"
          + name      = "admin-ingress"
          + offer_url = (known after apply)
        }
    }

  # juju_integration.integration["6"] will be created
  + resource "juju_integration" "integration" {
      + id    = (known after apply)
      + model = "identity-platform"

      + application {
          + endpoint  = "admin-ingress"
          + name      = "kratos"
          + offer_url = (known after apply)
        }
      + application {
          + endpoint  = "ingress"
          + name      = "admin-ingress"
          + offer_url = (known after apply)
        }
    }

  # juju_integration.integration["7"] will be created
  + resource "juju_integration" "integration" {
      + id    = (known after apply)
      + model = "identity-platform"

      + application {
          + endpoint  = "kratos-external-idp"
          + name      = "kratos"
          + offer_url = (known after apply)
        }
      + application {
          + endpoint  = "kratos-external-idp"
          + name      = "kratos-external-idp-integrator"
          + offer_url = (known after apply)
        }
    }

  # juju_integration.integration["8"] will be created
  + resource "juju_integration" "integration" {
      + id    = (known after apply)
      + model = "identity-platform"

      + application {
          + endpoint  = "endpoint-info"
          + name      = "hydra"
          + offer_url = (known after apply)
        }
      + application {
          + endpoint  = "endpoint-info"
          + name      = "kratos"
          + offer_url = (known after apply)
        }
    }

  # juju_integration.integration["9"] will be created
  + resource "juju_integration" "integration" {
      + id    = (known after apply)
      + model = "identity-platform"

      + application {
          + endpoint  = "endpoint-info"
          + name      = "hydra"
          + offer_url = (known after apply)
        }
      + application {
          + endpoint  = "endpoint-info"
          + name      = "login-ui"
          + offer_url = (known after apply)
        }
    }

  # module.admin_ingress.juju_application.ingress will be created
  + resource "juju_application" "ingress" {
      + constraints = (known after apply)
      + id          = (known after apply)
      + model       = "identity-platform"
      + name        = "admin-ingress"
      + placement   = (known after apply)
      + principal   = (known after apply)
      + trust       = true
      + units       = 1

      + charm {
          + channel  = "edge"
          + name     = "traefik-k8s"
          + revision = (known after apply)
          + series   = "focal"
        }
    }

  # module.kratos_external_idp_integrator.juju_application.external_idp_integrator will be created
  + resource "juju_application" "external_idp_integrator" {
      + config      = (sensitive value)
      + constraints = (known after apply)
      + id          = (known after apply)
      + model       = "identity-platform"
      + name        = "kratos-external-idp-integrator"
      + placement   = (known after apply)
      + principal   = (known after apply)
      + trust       = true
      + units       = 1

      + charm {
          + channel  = "edge"
          + name     = "kratos-external-idp-integrator"
          + revision = (known after apply)
          + series   = "jammy"
        }
    }

  # module.postgresql.juju_application.postgresql will be created
  + resource "juju_application" "postgresql" {
      + constraints = (known after apply)
      + id          = (known after apply)
      + model       = "identity-platform"
      + name        = "postgresql"
      + placement   = (known after apply)
      + principal   = (known after apply)
      + trust       = true
      + units       = 1

      + charm {
          + channel  = "14/stable"
          + name     = "postgresql-k8s"
          + revision = (known after apply)
          + series   = "jammy"
        }
    }

  # module.public_ingress.juju_application.ingress will be created
  + resource "juju_application" "ingress" {
      + constraints = (known after apply)
      + id          = (known after apply)
      + model       = "identity-platform"
      + name        = "public-ingress"
      + placement   = (known after apply)
      + principal   = (known after apply)
      + trust       = true
      + units       = 1

      + charm {
          + channel  = "edge"
          + name     = "traefik-k8s"
          + revision = (known after apply)
          + series   = "focal"
        }
    }

Plan: 20 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @wood-push-melon, Action: `pull_request`, Working Directory: ``, Workflow: `Pull Request`*